---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.Equals(System.Object)
source: html/6e857b68-4e76-8dc6-19c6-531a0db51429.htm
---
# Autodesk.Revit.DB.WorksetId.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another object.